{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 73], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "convolution1d_1", "class_name": "Convolution1D", "config": {"name": "convolution1d_1", "trainable": true, "nb_filter": 35, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "convolution1d_2", "class_name": "Convolution1D", "config": {"name": "convolution1d_2", "trainable": true, "nb_filter": 35, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_2", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "convolution1d_3", "class_name": "Convolution1D", "config": {"name": "convolution1d_3", "trainable": true, "nb_filter": 35, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_3", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_3", 0, 0], ["activation_1", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_1", 0, 0], ["merge_1", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "convolution1d_4", "class_name": "Convolution1D", "config": {"name": "convolution1d_4", "trainable": true, "nb_filter": 35, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_4", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"name": "convolution1d_5", "class_name": "Convolution1D", "config": {"name": "convolution1d_5", "trainable": true, "nb_filter": 35, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_5", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"name": "convolution1d_6", "class_name": "Convolution1D", "config": {"name": "convolution1d_6", "trainable": true, "nb_filter": 35, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_6", 0, 0]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"name": "merge_3", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_6", 0, 0], ["activation_4", 0, 0]]]}, {"name": "merge_4", "class_name": "Merge", "config": {"name": "merge_4", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["activation_4", 0, 0], ["merge_3", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.2}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"name": "lstm_3", "class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 35, "input_length": null, "output_dim": 35, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "lstm_4", "class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "return_sequences": true, "go_backwards": false, "stateful": false, "unroll": false, "consume_less": "cpu", "input_dim": 35, "input_length": null, "output_dim": 35, "init": "glorot_uniform", "inner_init": "orthogonal", "forget_bias_init": "one", "activation": "tanh", "inner_activation": "hard_sigmoid", "W_regularizer": null, "U_regularizer": null, "b_regularizer": null, "dropout_W": 0.0, "dropout_U": 0.0}, "inbound_nodes": [[["lstm_3", 0, 0]]]}, {"name": "merge_5", "class_name": "Merge", "config": {"name": "merge_5", "mode": "concat", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["dropout_2", 0, 0], ["lstm_4", 0, 0]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.2}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"name": "local_start_conv", "class_name": "Convolution1D", "config": {"name": "local_start_conv", "trainable": true, "nb_filter": 1, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "local_start_nor", "class_name": "BatchNormalization", "config": {"name": "local_start_nor", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["local_start_conv", 0, 0]]]}, {"name": "local_start_softmax", "class_name": "Dense", "config": {"name": "local_start_softmax", "trainable": true, "output_dim": 8, "init": "he_normal", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1}, "inbound_nodes": [[["local_start_nor", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["local_start_softmax", 0, 0]]}, "keras_version": "1.2.2"}