{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 73], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution1d_1", "class_name": "Convolution1D", "config": {"name": "convolution1d_1", "trainable": true, "nb_filter": 40, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "convolution1d_2", "class_name": "Convolution1D", "config": {"name": "convolution1d_2", "trainable": true, "nb_filter": 40, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_2", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "convolution1d_3", "class_name": "Convolution1D", "config": {"name": "convolution1d_3", "trainable": true, "nb_filter": 40, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_3", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"name": "convolution1d_4", "class_name": "Convolution1D", "config": {"name": "convolution1d_4", "trainable": true, "nb_filter": 40, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_4", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"name": "convolution1d_5", "class_name": "Convolution1D", "config": {"name": "convolution1d_5", "trainable": true, "nb_filter": 40, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_5", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"name": "local_start_conv", "class_name": "Convolution1D", "config": {"name": "local_start_conv", "trainable": true, "nb_filter": 1, "filter_length": 6, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "local_start_nor", "class_name": "BatchNormalization", "config": {"name": "local_start_nor", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["local_start_conv", 0, 0]]]}, {"name": "local_start_softmax", "class_name": "Dense", "config": {"name": "local_start_softmax", "trainable": true, "output_dim": 8, "init": "he_normal", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1}, "inbound_nodes": [[["local_start_nor", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["local_start_softmax", 0, 0]]}, "keras_version": "1.2.2"}