{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 73], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "convolution1d_1", "class_name": "Convolution1D", "config": {"name": "convolution1d_1", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]]}, {"name": "convolution1d_2", "class_name": "Convolution1D", "config": {"name": "convolution1d_2", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["convolution1d_1", 0, 0]]]}, {"name": "batchnormalization_1", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_2", 0, 0]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"name": "convolution1d_3", "class_name": "Convolution1D", "config": {"name": "convolution1d_3", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "he_normal", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_1", 0, 0]]]}, {"name": "merge_1", "class_name": "Merge", "config": {"name": "merge_1", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_2", 0, 0], ["convolution1d_3", 0, 0]]]}, {"name": "batchnormalization_2", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_1", 0, 0]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"name": "convolution1d_4", "class_name": "Convolution1D", "config": {"name": "convolution1d_4", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_2", 0, 0]]]}, {"name": "merge_2", "class_name": "Merge", "config": {"name": "merge_2", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_2", 0, 0], ["convolution1d_4", 0, 0]]]}, {"name": "batchnormalization_3", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_3", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_2", 0, 0]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"name": "convolution1d_5", "class_name": "Convolution1D", "config": {"name": "convolution1d_5", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_3", 0, 0]]]}, {"name": "merge_3", "class_name": "Merge", "config": {"name": "merge_3", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_2", 0, 0], ["convolution1d_5", 0, 0]]]}, {"name": "batchnormalization_4", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_4", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_3", 0, 0]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "p": 0.1}, "inbound_nodes": [[["activation_4", 0, 0]]]}, {"name": "convolution1d_6", "class_name": "Convolution1D", "config": {"name": "convolution1d_6", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"name": "batchnormalization_5", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_5", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_6", 0, 0]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"name": "convolution1d_7", "class_name": "Convolution1D", "config": {"name": "convolution1d_7", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "he_normal", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_5", 0, 0]]]}, {"name": "merge_4", "class_name": "Merge", "config": {"name": "merge_4", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_6", 0, 0], ["convolution1d_7", 0, 0]]]}, {"name": "batchnormalization_6", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_6", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_4", 0, 0]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"name": "convolution1d_8", "class_name": "Convolution1D", "config": {"name": "convolution1d_8", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_6", 0, 0]]]}, {"name": "merge_5", "class_name": "Merge", "config": {"name": "merge_5", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_6", 0, 0], ["convolution1d_8", 0, 0]]]}, {"name": "batchnormalization_7", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_7", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_5", 0, 0]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"name": "convolution1d_9", "class_name": "Convolution1D", "config": {"name": "convolution1d_9", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_7", 0, 0]]]}, {"name": "merge_6", "class_name": "Merge", "config": {"name": "merge_6", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_6", 0, 0], ["convolution1d_9", 0, 0]]]}, {"name": "batchnormalization_8", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_8", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_6", 0, 0]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_8", 0, 0]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "p": 0.1}, "inbound_nodes": [[["activation_8", 0, 0]]]}, {"name": "convolution1d_10", "class_name": "Convolution1D", "config": {"name": "convolution1d_10", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["dropout_2", 0, 0]]]}, {"name": "batchnormalization_9", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_9", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_10", 0, 0]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_9", 0, 0]]]}, {"name": "convolution1d_11", "class_name": "Convolution1D", "config": {"name": "convolution1d_11", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "he_normal", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_9", 0, 0]]]}, {"name": "merge_7", "class_name": "Merge", "config": {"name": "merge_7", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_10", 0, 0], ["convolution1d_11", 0, 0]]]}, {"name": "batchnormalization_10", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_10", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_7", 0, 0]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_10", 0, 0]]]}, {"name": "convolution1d_12", "class_name": "Convolution1D", "config": {"name": "convolution1d_12", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_10", 0, 0]]]}, {"name": "merge_8", "class_name": "Merge", "config": {"name": "merge_8", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_10", 0, 0], ["convolution1d_12", 0, 0]]]}, {"name": "batchnormalization_11", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_11", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_8", 0, 0]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_11", 0, 0]]]}, {"name": "convolution1d_13", "class_name": "Convolution1D", "config": {"name": "convolution1d_13", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_11", 0, 0]]]}, {"name": "merge_9", "class_name": "Merge", "config": {"name": "merge_9", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_10", 0, 0], ["convolution1d_13", 0, 0]]]}, {"name": "batchnormalization_12", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_12", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_9", 0, 0]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_12", 0, 0]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.1}, "inbound_nodes": [[["activation_12", 0, 0]]]}, {"name": "convolution1d_14", "class_name": "Convolution1D", "config": {"name": "convolution1d_14", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["dropout_3", 0, 0]]]}, {"name": "batchnormalization_13", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_13", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_14", 0, 0]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_13", 0, 0]]]}, {"name": "convolution1d_15", "class_name": "Convolution1D", "config": {"name": "convolution1d_15", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "he_normal", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_13", 0, 0]]]}, {"name": "merge_10", "class_name": "Merge", "config": {"name": "merge_10", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_14", 0, 0], ["convolution1d_15", 0, 0]]]}, {"name": "batchnormalization_14", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_14", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_10", 0, 0]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_14", 0, 0]]]}, {"name": "convolution1d_16", "class_name": "Convolution1D", "config": {"name": "convolution1d_16", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_14", 0, 0]]]}, {"name": "merge_11", "class_name": "Merge", "config": {"name": "merge_11", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_14", 0, 0], ["convolution1d_16", 0, 0]]]}, {"name": "batchnormalization_15", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_15", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_11", 0, 0]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_15", 0, 0]]]}, {"name": "convolution1d_17", "class_name": "Convolution1D", "config": {"name": "convolution1d_17", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_15", 0, 0]]]}, {"name": "merge_12", "class_name": "Merge", "config": {"name": "merge_12", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_14", 0, 0], ["convolution1d_17", 0, 0]]]}, {"name": "batchnormalization_16", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_16", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_12", 0, 0]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_16", 0, 0]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.1}, "inbound_nodes": [[["activation_16", 0, 0]]]}, {"name": "convolution1d_18", "class_name": "Convolution1D", "config": {"name": "convolution1d_18", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["dropout_4", 0, 0]]]}, {"name": "batchnormalization_17", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_17", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution1d_18", 0, 0]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_17", 0, 0]]]}, {"name": "convolution1d_19", "class_name": "Convolution1D", "config": {"name": "convolution1d_19", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "he_normal", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_17", 0, 0]]]}, {"name": "merge_13", "class_name": "Merge", "config": {"name": "merge_13", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_18", 0, 0], ["convolution1d_19", 0, 0]]]}, {"name": "batchnormalization_18", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_18", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_13", 0, 0]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_18", 0, 0]]]}, {"name": "convolution1d_20", "class_name": "Convolution1D", "config": {"name": "convolution1d_20", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_18", 0, 0]]]}, {"name": "merge_14", "class_name": "Merge", "config": {"name": "merge_14", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_18", 0, 0], ["convolution1d_20", 0, 0]]]}, {"name": "batchnormalization_19", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_19", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_14", 0, 0]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_19", 0, 0]]]}, {"name": "convolution1d_21", "class_name": "Convolution1D", "config": {"name": "convolution1d_21", "trainable": true, "nb_filter": 35, "filter_length": 3, "init": "glorot_uniform", "activation": "linear", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["activation_19", 0, 0]]]}, {"name": "merge_15", "class_name": "Merge", "config": {"name": "merge_15", "mode": "sum", "mode_type": "raw", "concat_axis": -1, "dot_axes": -1, "output_shape": null, "output_shape_type": "raw", "output_mask": null, "output_mask_type": "raw", "arguments": {}}, "inbound_nodes": [[["convolution1d_18", 0, 0], ["convolution1d_21", 0, 0]]]}, {"name": "batchnormalization_20", "class_name": "BatchNormalization", "config": {"name": "batchnormalization_20", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["merge_15", 0, 0]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batchnormalization_20", 0, 0]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "p": 0.1}, "inbound_nodes": [[["activation_20", 0, 0]]]}, {"name": "local_start_conv", "class_name": "Convolution1D", "config": {"name": "local_start_conv", "trainable": true, "nb_filter": 1, "filter_length": 3, "init": "he_normal", "activation": "relu", "border_mode": "same", "subsample_length": 1, "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": null, "input_length": null}, "inbound_nodes": [[["dropout_5", 0, 0]]]}, {"name": "local_start_nor", "class_name": "BatchNormalization", "config": {"name": "local_start_nor", "trainable": true, "epsilon": 0.001, "mode": 0, "axis": 2, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["local_start_conv", 0, 0]]]}, {"name": "local_start_softmax", "class_name": "Dense", "config": {"name": "local_start_softmax", "trainable": true, "output_dim": 8, "init": "he_normal", "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "activity_regularizer": null, "W_constraint": null, "b_constraint": null, "bias": true, "input_dim": 1}, "inbound_nodes": [[["local_start_nor", 0, 0]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["local_start_softmax", 0, 0]]}, "keras_version": "1.2.2"}