{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 73], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["convolution1d_4", 0, 0]]], "name": "activation_4"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_3"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_5", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "convolution1d_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "activation_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["convolution1d_5", 0, 0]]], "name": "activation_5"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_3", 0, 0], ["activation_5", 0, 0]]], "name": "merge_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_7", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution1d_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["convolution1d_7", 0, 0]]], "name": "activation_7"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_6", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution1d_6"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_8", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_7", 0, 0]]], "name": "convolution1d_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "activation_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["convolution1d_6", 0, 0]]], "name": "activation_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["convolution1d_8", 0, 0]]], "name": "activation_8"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_2", 0, 0], ["activation_6", 0, 0], ["activation_8", 0, 0]]], "name": "merge_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_11", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution1d_11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["convolution1d_11", 0, 0]]], "name": "activation_11"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_10", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution1d_10"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_12", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_11", 0, 0]]], "name": "convolution1d_12"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["convolution1d_10", 0, 0]]], "name": "activation_10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["convolution1d_12", 0, 0]]], "name": "activation_12"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_10", 0, 0], ["activation_12", 0, 0]]], "name": "merge_3"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_14", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "convolution1d_14"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["convolution1d_14", 0, 0]]], "name": "activation_14"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_9", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution1d_9"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_13", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "convolution1d_13"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_15", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_14", 0, 0]]], "name": "convolution1d_15"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "activation_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["convolution1d_9", 0, 0]]], "name": "activation_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["convolution1d_13", 0, 0]]], "name": "activation_13"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["convolution1d_15", 0, 0]]], "name": "activation_15"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_1", 0, 0], ["activation_9", 0, 0], ["activation_13", 0, 0], ["activation_15", 0, 0]]], "name": "merge_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Dropout", "config": {"p": 0.35, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "dropout_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_19", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution1d_19"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["convolution1d_19", 0, 0]]], "name": "activation_19"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_18", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution1d_18"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_20", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_19", 0, 0]]], "name": "convolution1d_20"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["convolution1d_18", 0, 0]]], "name": "activation_18"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["convolution1d_20", 0, 0]]], "name": "activation_20"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_18", 0, 0], ["activation_20", 0, 0]]], "name": "merge_5"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_22", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "convolution1d_22"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["convolution1d_22", 0, 0]]], "name": "activation_22"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_17", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution1d_17"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_21", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "convolution1d_21"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_23", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_22", 0, 0]]], "name": "convolution1d_23"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["convolution1d_17", 0, 0]]], "name": "activation_17"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["convolution1d_21", 0, 0]]], "name": "activation_21"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "inbound_nodes": [[["convolution1d_23", 0, 0]]], "name": "activation_23"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_17", 0, 0], ["activation_21", 0, 0], ["activation_23", 0, 0]]], "name": "merge_6"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_26", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "convolution1d_26"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_26"}, "inbound_nodes": [[["convolution1d_26", 0, 0]]], "name": "activation_26"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_25", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "convolution1d_25"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_27", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_26", 0, 0]]], "name": "convolution1d_27"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "inbound_nodes": [[["convolution1d_25", 0, 0]]], "name": "activation_25"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_27"}, "inbound_nodes": [[["convolution1d_27", 0, 0]]], "name": "activation_27"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_25", 0, 0], ["activation_27", 0, 0]]], "name": "merge_7"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_29", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "convolution1d_29"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_29"}, "inbound_nodes": [[["convolution1d_29", 0, 0]]], "name": "activation_29"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_16", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution1d_16"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_24", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "convolution1d_24"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_28", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "convolution1d_28"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_30", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_29", 0, 0]]], "name": "convolution1d_30"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["convolution1d_16", 0, 0]]], "name": "activation_16"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "inbound_nodes": [[["convolution1d_24", 0, 0]]], "name": "activation_24"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_28"}, "inbound_nodes": [[["convolution1d_28", 0, 0]]], "name": "activation_28"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_30"}, "inbound_nodes": [[["convolution1d_30", 0, 0]]], "name": "activation_30"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_16", 0, 0], ["activation_24", 0, 0], ["activation_28", 0, 0], ["activation_30", 0, 0]]], "name": "merge_8"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Dropout", "config": {"p": 0.35, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "dropout_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_34", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution1d_34"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_34"}, "inbound_nodes": [[["convolution1d_34", 0, 0]]], "name": "activation_34"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_33", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution1d_33"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_35", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_34", 0, 0]]], "name": "convolution1d_35"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_33"}, "inbound_nodes": [[["convolution1d_33", 0, 0]]], "name": "activation_33"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_35"}, "inbound_nodes": [[["convolution1d_35", 0, 0]]], "name": "activation_35"}, {"class_name": "Merge", "config": {"name": "merge_9", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_33", 0, 0], ["activation_35", 0, 0]]], "name": "merge_9"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_37", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "convolution1d_37"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_37"}, "inbound_nodes": [[["convolution1d_37", 0, 0]]], "name": "activation_37"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_32", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution1d_32"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_36", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "convolution1d_36"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_38", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_37", 0, 0]]], "name": "convolution1d_38"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_32"}, "inbound_nodes": [[["convolution1d_32", 0, 0]]], "name": "activation_32"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_36"}, "inbound_nodes": [[["convolution1d_36", 0, 0]]], "name": "activation_36"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_38"}, "inbound_nodes": [[["convolution1d_38", 0, 0]]], "name": "activation_38"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_32", 0, 0], ["activation_36", 0, 0], ["activation_38", 0, 0]]], "name": "merge_10"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_41", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "convolution1d_41"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_41"}, "inbound_nodes": [[["convolution1d_41", 0, 0]]], "name": "activation_41"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_40", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "convolution1d_40"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_42", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_41", 0, 0]]], "name": "convolution1d_42"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_40"}, "inbound_nodes": [[["convolution1d_40", 0, 0]]], "name": "activation_40"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_42"}, "inbound_nodes": [[["convolution1d_42", 0, 0]]], "name": "activation_42"}, {"class_name": "Merge", "config": {"name": "merge_11", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_40", 0, 0], ["activation_42", 0, 0]]], "name": "merge_11"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_44", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "convolution1d_44"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_44"}, "inbound_nodes": [[["convolution1d_44", 0, 0]]], "name": "activation_44"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_31", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution1d_31"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_39", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "convolution1d_39"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_43", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "convolution1d_43"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_45", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_44", 0, 0]]], "name": "convolution1d_45"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_31"}, "inbound_nodes": [[["convolution1d_31", 0, 0]]], "name": "activation_31"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_39"}, "inbound_nodes": [[["convolution1d_39", 0, 0]]], "name": "activation_39"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_43"}, "inbound_nodes": [[["convolution1d_43", 0, 0]]], "name": "activation_43"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_45"}, "inbound_nodes": [[["convolution1d_45", 0, 0]]], "name": "activation_45"}, {"class_name": "Merge", "config": {"name": "merge_12", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_31", 0, 0], ["activation_39", 0, 0], ["activation_43", 0, 0], ["activation_45", 0, 0]]], "name": "merge_12"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["merge_12", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Dropout", "config": {"p": 0.35, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "dropout_3"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_49", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution1d_49"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_49"}, "inbound_nodes": [[["convolution1d_49", 0, 0]]], "name": "activation_49"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_48", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution1d_48"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_50", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_49", 0, 0]]], "name": "convolution1d_50"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_48"}, "inbound_nodes": [[["convolution1d_48", 0, 0]]], "name": "activation_48"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_50"}, "inbound_nodes": [[["convolution1d_50", 0, 0]]], "name": "activation_50"}, {"class_name": "Merge", "config": {"name": "merge_13", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_48", 0, 0], ["activation_50", 0, 0]]], "name": "merge_13"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_52", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_13", 0, 0]]], "name": "convolution1d_52"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_52"}, "inbound_nodes": [[["convolution1d_52", 0, 0]]], "name": "activation_52"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_47", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution1d_47"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_51", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_13", 0, 0]]], "name": "convolution1d_51"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_53", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_52", 0, 0]]], "name": "convolution1d_53"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_47"}, "inbound_nodes": [[["convolution1d_47", 0, 0]]], "name": "activation_47"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_51"}, "inbound_nodes": [[["convolution1d_51", 0, 0]]], "name": "activation_51"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_53"}, "inbound_nodes": [[["convolution1d_53", 0, 0]]], "name": "activation_53"}, {"class_name": "Merge", "config": {"name": "merge_14", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_47", 0, 0], ["activation_51", 0, 0], ["activation_53", 0, 0]]], "name": "merge_14"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_56", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_14", 0, 0]]], "name": "convolution1d_56"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_56"}, "inbound_nodes": [[["convolution1d_56", 0, 0]]], "name": "activation_56"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_55", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_14", 0, 0]]], "name": "convolution1d_55"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_57", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_56", 0, 0]]], "name": "convolution1d_57"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_55"}, "inbound_nodes": [[["convolution1d_55", 0, 0]]], "name": "activation_55"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_57"}, "inbound_nodes": [[["convolution1d_57", 0, 0]]], "name": "activation_57"}, {"class_name": "Merge", "config": {"name": "merge_15", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_55", 0, 0], ["activation_57", 0, 0]]], "name": "merge_15"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_59", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_15", 0, 0]]], "name": "convolution1d_59"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_59"}, "inbound_nodes": [[["convolution1d_59", 0, 0]]], "name": "activation_59"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_46", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution1d_46"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_54", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_14", 0, 0]]], "name": "convolution1d_54"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_58", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_15", 0, 0]]], "name": "convolution1d_58"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_60", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_59", 0, 0]]], "name": "convolution1d_60"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_46"}, "inbound_nodes": [[["convolution1d_46", 0, 0]]], "name": "activation_46"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_54"}, "inbound_nodes": [[["convolution1d_54", 0, 0]]], "name": "activation_54"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_58"}, "inbound_nodes": [[["convolution1d_58", 0, 0]]], "name": "activation_58"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_60"}, "inbound_nodes": [[["convolution1d_60", 0, 0]]], "name": "activation_60"}, {"class_name": "Merge", "config": {"name": "merge_16", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_46", 0, 0], ["activation_54", 0, 0], ["activation_58", 0, 0], ["activation_60", 0, 0]]], "name": "merge_16"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["merge_16", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "Dropout", "config": {"p": 0.35, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "dropout_4"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_64", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution1d_64"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_64"}, "inbound_nodes": [[["convolution1d_64", 0, 0]]], "name": "activation_64"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_63", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution1d_63"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_65", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_64", 0, 0]]], "name": "convolution1d_65"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_63"}, "inbound_nodes": [[["convolution1d_63", 0, 0]]], "name": "activation_63"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_65"}, "inbound_nodes": [[["convolution1d_65", 0, 0]]], "name": "activation_65"}, {"class_name": "Merge", "config": {"name": "merge_17", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_63", 0, 0], ["activation_65", 0, 0]]], "name": "merge_17"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_67", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_17", 0, 0]]], "name": "convolution1d_67"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_67"}, "inbound_nodes": [[["convolution1d_67", 0, 0]]], "name": "activation_67"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_62", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "convolution1d_62"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_66", "activity_regularizer": null, "trainable": true, "filter_length": 4, "init": "he_normal", "bias": true, "nb_filter": 28, "input_dim": 