{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 73], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "he_normal", "bias": true, "nb_filter": 40, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_2", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "activation_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "he_normal", "bias": true, "nb_filter": 40, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "convolution1d_2"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_3", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "batchnormalization_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "he_normal", "bias": true, "nb_filter": 40, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "convolution1d_3"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_4", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "batchnormalization_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "activation_3"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "he_normal", "bias": true, "nb_filter": 40, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_3", 0, 0]]], "name": "convolution1d_4"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_5", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_4", 0, 0]]], "name": "batchnormalization_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "activation_4"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_5", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "he_normal", "bias": true, "nb_filter": 40, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "convolution1d_5"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_6", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_5", 0, 0]]], "name": "batchnormalization_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "activation_5"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "local_start_conv", "activity_regularizer": null, "trainable": true, "filter_length": 5, "init": "he_normal", "bias": true, "nb_filter": 1, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_5", 0, 0]]], "name": "local_start_conv"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "local_start_nor", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["local_start_conv", 0, 0]]], "name": "local_start_nor"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "local_start_softmax", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3}, "inbound_nodes": [[["local_start_nor", 0, 0]]], "name": "local_start_softmax"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["local_start_softmax", 0, 0]], "name": "model_1"}}