{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 73], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "batchnormalization_1", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["convolution1d_1", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_2", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "convolution1d_2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["convolution1d_2", 0, 0]]], "name": "activation_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_3", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "convolution1d_3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "inbound_nodes": [[["convolution1d_3", 0, 0]]], "name": "activation_3"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_3", 0, 0], ["activation_1", 0, 0]]], "name": "merge_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_4", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_1", 0, 0]]], "name": "convolution1d_4"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "inbound_nodes": [[["convolution1d_4", 0, 0]]], "name": "activation_4"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_5", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_4", 0, 0]]], "name": "convolution1d_5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["convolution1d_5", 0, 0]]], "name": "activation_5"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_5", 0, 0], ["merge_1", 0, 0]]], "name": "merge_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_6", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_2", 0, 0]]], "name": "convolution1d_6"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["convolution1d_6", 0, 0]]], "name": "activation_6"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_7", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_6", 0, 0]]], "name": "convolution1d_7"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["convolution1d_7", 0, 0]]], "name": "activation_7"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_7", 0, 0], ["merge_2", 0, 0]]], "name": "merge_3"}, {"class_name": "Dropout", "config": {"p": 0.15, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["merge_3", 0, 0]]], "name": "dropout_1"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_8", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "convolution1d_8"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["convolution1d_8", 0, 0]]], "name": "activation_8"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_9", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_8", 0, 0]]], "name": "convolution1d_9"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_9"}, "inbound_nodes": [[["convolution1d_9", 0, 0]]], "name": "activation_9"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_9", 0, 0], ["dropout_1", 0, 0]]], "name": "merge_4"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_10", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_4", 0, 0]]], "name": "convolution1d_10"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_10"}, "inbound_nodes": [[["convolution1d_10", 0, 0]]], "name": "activation_10"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_11", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_10", 0, 0]]], "name": "convolution1d_11"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["convolution1d_11", 0, 0]]], "name": "activation_11"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_11", 0, 0], ["merge_4", 0, 0]]], "name": "merge_5"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_12", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_5", 0, 0]]], "name": "convolution1d_12"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["convolution1d_12", 0, 0]]], "name": "activation_12"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_13", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_12", 0, 0]]], "name": "convolution1d_13"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["convolution1d_13", 0, 0]]], "name": "activation_13"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_13", 0, 0], ["merge_5", 0, 0]]], "name": "merge_6"}, {"class_name": "Dropout", "config": {"p": 0.15, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["merge_6", 0, 0]]], "name": "dropout_2"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_14", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "convolution1d_14"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["convolution1d_14", 0, 0]]], "name": "activation_14"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_15", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_14", 0, 0]]], "name": "convolution1d_15"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["convolution1d_15", 0, 0]]], "name": "activation_15"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_15", 0, 0], ["dropout_2", 0, 0]]], "name": "merge_7"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_16", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "convolution1d_16"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["convolution1d_16", 0, 0]]], "name": "activation_16"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_17", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_16", 0, 0]]], "name": "convolution1d_17"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["convolution1d_17", 0, 0]]], "name": "activation_17"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_17", 0, 0], ["merge_7", 0, 0]]], "name": "merge_8"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_18", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_8", 0, 0]]], "name": "convolution1d_18"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["convolution1d_18", 0, 0]]], "name": "activation_18"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_19", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_18", 0, 0]]], "name": "convolution1d_19"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["convolution1d_19", 0, 0]]], "name": "activation_19"}, {"class_name": "Merge", "config": {"name": "merge_9", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_19", 0, 0], ["merge_8", 0, 0]]], "name": "merge_9"}, {"class_name": "Dropout", "config": {"p": 0.15, "trainable": true, "name": "dropout_3"}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "dropout_3"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_20", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["dropout_3", 0, 0]]], "name": "convolution1d_20"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["convolution1d_20", 0, 0]]], "name": "activation_20"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_21", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_20", 0, 0]]], "name": "convolution1d_21"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["convolution1d_21", 0, 0]]], "name": "activation_21"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_21", 0, 0], ["dropout_3", 0, 0]]], "name": "merge_10"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_22", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_10", 0, 0]]], "name": "convolution1d_22"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["convolution1d_22", 0, 0]]], "name": "activation_22"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_23", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_22", 0, 0]]], "name": "convolution1d_23"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}, "inbound_nodes": [[["convolution1d_23", 0, 0]]], "name": "activation_23"}, {"class_name": "Merge", "config": {"name": "merge_11", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_23", 0, 0], ["merge_10", 0, 0]]], "name": "merge_11"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_24", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_11", 0, 0]]], "name": "convolution1d_24"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_24"}, "inbound_nodes": [[["convolution1d_24", 0, 0]]], "name": "activation_24"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "convolution1d_25", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 42, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["activation_24", 0, 0]]], "name": "convolution1d_25"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_25"}, "inbound_nodes": [[["convolution1d_25", 0, 0]]], "name": "activation_25"}, {"class_name": "Merge", "config": {"name": "merge_12", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["activation_25", 0, 0], ["merge_11", 0, 0]]], "name": "merge_12"}, {"class_name": "Dropout", "config": {"p": 0.15, "trainable": true, "name": "dropout_4"}, "inbound_nodes": [[["merge_12", 0, 0]]], "name": "dropout_4"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 42, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 42}, "inbound_nodes": [[["dropout_4", 0, 0]]], "name": "dense_1"}, {"class_name": "Merge", "config": {"name": "merge_13", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "arguments": {}, "output_mask": null, "mode": "mul", "output_shape": 42, "output_shape_type": "raw"}, "inbound_nodes": [[["dropout_4", 0, 0], ["dense_1", 0, 0]]], "name": "merge_13"}, {"class_name": "Convolution1D", "config": {"W_constraint": null, "b_constraint": null, "name": "local_start_conv", "activity_regularizer": null, "trainable": true, "filter_length": 3, "init": "he_normal", "bias": true, "nb_filter": 1, "input_dim": null, "subsample_length": 1, "border_mode": "same", "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["merge_13", 0, 0]]], "name": "local_start_conv"}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "name": "local_start_nor", "epsilon": 0.001, "trainable": true, "mode": 0, "beta_regularizer": null, "momentum": 0.99, "axis": 2}, "inbound_nodes": [[["local_start_conv", 0, 0]]], "name": "local_start_nor"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "local_start_softmax", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": 1, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3}, "inbound_nodes": [[["local_start_nor", 0, 0]]], "name": "local_start_softmax"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["local_start_softmax", 0, 0]], "name": "model_1"}}